gearPump/case_overset/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allclean
runApplication cartesian2DMesh
runApplication checkMesh
mergeMeshes . ../gear0 -overwrite 
mergeMeshes . ../gear1 -overwrite

runApplication topoSet
restore0Dir
runApplication setFields
#------------------------------------------------------------------------------
