gearPump/case_overset/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// numberOfSubdomains 6;
// 
// method          hierarchical;//simple;
// 
// hierarchicalCoeffs//simpleCoeffs
// {
//     n               (3 2 1);
//     delta           0.001;
//     order           xyz;
// }

numberOfSubdomains 8;

method          scotch;
// ************************************************************************* //
