gearPump/case_overset/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
( 
    {
        name    c0;
        type    cellSet;
        action  new;
        source  regionsToCell;
        insidePoints ((0.035 0.020 -0.00005));
    }

    {
        name    c1;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     c0;
    }

    {
        name    c1;
        type    cellSet;
        action  invert;
    }

    {
        name    c2;
        type    cellSet;
        action  new;
        source  regionsToCell;
        insidePoints ((0.020 0.035 -0.00005));
        set     c1;
    }

    {
        name    c1;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        set     c2;
    }
    
    
    {
        name    movingZone1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c1;
        }
    }
    {
        name    movingZone2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set c2;
        }
    }
);

// ************************************************************************* //
